app/controllers/articles_controller.rb

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
---
  def destroy
    Article.find(params[:id]).destroy